### homework: previous interview question
-column names as a new element

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'a':[1,3,4], 'b':[2,1,3],'c':[3,4,1],'d':[4,2,2]})

In [3]:
df

   a  b  c  d
0  1  2  3  4
1  3  1  4  2
2  4  3  1  2

In [4]:
l_new = []
for i in range(3):
    l = df.iloc[i]
#     print(l)
    s = ''
    for j in range(len(l)):
        s += l.index.values[l.values.argsort()[j]]
    l_new.append(s)
l_new

['abcd', 'bdac', 'cdba']

In [5]:
df['new'] = l_new
df

   a  b  c  d   new
0  1  2  3  4  abcd
1  3  1  4  2  bdac
2  4  3  1  2  cdba